In [7]:
import pandas as pd

In [8]:
data = pd.read_csv("question1.csv")

In [14]:
# Summary
data.describe()

          order_id      shop_id      user_id   order_amount  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

In [15]:
data.head()

   order_id  shop_id  user_id  ...  total_items  payment_method           created_at
0         1       53      746  ...            2            cash  2017-03-13 12:36:56
1         2       92      925  ...            1            cash  2017-03-03 17:38:52
2         3       44      861  ...            1            cash   2017-03-14 4:23:56
3         4       18      935  ...            1     credit_card  2017-03-26 12:43:37
4         5       18      883  ...            1     credit_card   2017-03-01 4:35:11

[5 rows x 7 columns]

In [10]:
# Naive AOV
data["order_amount"].mean()

3145.128

In [16]:
# Convert created_at to Date format
data["created_at"] = pd.to_datetime(data["created_at"])

In [ ]:
# Plot to see if the order amount has any relationship with items sold

In [27]:
# Average Amount per order
data["order_amount"].sum()/data["total_items"].sum()

357.92152221412965

In [28]:
# Supplementary
# Aggregate order_amount by Date to check date relationships
daily_data = data.resample('D', on='created_at').sum()

In [30]:
daily_data.head()

            order_id  shop_id  user_id  order_amount  total_items
created_at
2017-03-01    473269     8664   154069        106154          359
2017-03-02    450806     9174   153752       1588109         4351
2017-03-03    406374     7823   136091         48729          324
2017-03-04    386080     8933   142801        855504         2313
2017-03-05    396763     8712   137994        126293          320

In [31]:
# Daily AVerage Amount per Order
daily_data["avg_daily_order_amt"] = daily_data.apply(lambda row: row.order_amount / row.total_items, axis=1)
daily_data.head()

In [34]:
# Mean of daily orders
daily_data["avg_daily_order_amt"].mean()

377.8780865746204

In [47]:
# Aggregate orders by shop
shop_data = data.groupby(['shop_id'], as_index=False)['order_amount', 'total_items'].sum()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

In [48]:
shop_data

    shop_id  order_amount  total_items
0         1         13588           86
1         2          9588          102
2         3         14652           99
3         4         13184          103
4         5         13064           92
..      ...           ...          ...
95       96         16830          110
96       97         15552           96
97       98         14231          107
98       99         18330           94
99      100          8547           77

[100 rows x 3 columns]

In [55]:
# Shop AVerage Amount per Order
shop_data["avg_shop_order_amt"] = shop_data.apply(lambda row: row.order_amount / row.total_items, axis=1)
shop_data["avg_shop_order_amt"].mean()

407.99

In [57]:
# Outlier shop
shop_data.iloc[shop_data['avg_shop_order_amt'].idxmax()]

shop_id                    78.0
order_amount          2263800.0
total_items                88.0
avg_shop_order_amt      25725.0
Name: 77, dtype: float64